In [1]:
# Pandas

In [3]:
# 구조화된 데이터의 처리를 지원하는 Python 라이브러리
# 고성능 array 계산 라이브러리인 numpy와 통합하여 강력한 스프레드 시트 처리 기능 제공
# 인덱싱, 연산용함수, 전처리 함수 등을 제공
# 데이터 처리 및 통계 분석을 위해 사용

In [2]:
import pandas as pd

In [6]:
# Data URL
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
# Csv 타입 데이터 로드, separate 는 빈공간으로 지정하고 Column 은 없음
df_data = pd.read_csv(data_url, sep='\s+', header=None)

In [7]:
df_data.head() # 처음 다섯줄 출력
# df_data.head(n) # n 줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [9]:
# column 이름 입력
df_data.columns = [
    "CRIM",
    "ZN",
    "INDUS",
    "CHAS",
    "NOX",
    "RM",
    "AGE",
    "DIS",
    "RAD",
    "TAX",
    "PTRATIO",
    "B",
    "LSTAT",
    "MEDV"
]
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [10]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

In [11]:
type(df_data.values)

numpy.ndarray

In [12]:
# 기본적인 것 부터 해보자

In [13]:
# series

In [14]:
# pandas 의 구성
# series : DataFrame 중 하나의 Column에 해당하는 데이터의 모음 Object
# DataFrame : Data Table 전체를 포함하는 Object

In [39]:
from pandas import Series, DataFrame
import numpy as np

In [40]:
# example_obj = Series()

In [41]:
list_data = [1, 2, 3, 4, 5]

# Numpy 를 pandas 에서 쓰기 위해 변환, 차이 : index 값이 있고 지정 가능
example_obj = Series(data = list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
# ndarray 의 subclass

In [43]:
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = Series(data=list_data, index=list_name) # index 이름 지정
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [44]:
example_obj.index # index 리스트만

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [45]:
example_obj.values # 값 리스트만

array([1, 2, 3, 4, 5], dtype=int64)

In [47]:
type(example_obj.values)

numpy.ndarray

In [53]:
example_obj.name = "number" # data 에 대한 정보 저장
example_obj.index.name = 'alphabet' # 인덱스 이름 지정
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float64

In [46]:
# dict 으로도 Series 생성 가능
dict_data = {"a":1 , "b":2, "c":3 , "d":4 , "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="exmaple_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: exmaple_data, dtype: float32

In [48]:
example_obj['a'] # data index 에 접근하기

1.0

In [49]:
example_obj['a'] = 3.2 # data index 에 값 할당하기
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: exmaple_data, dtype: float32

In [51]:
# astype : 데이터 유형 변경
example_obj = example_obj.astype(float)
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: exmaple_data, dtype: float64

In [56]:
dict_data_1 = {"a":1 , "b":2, "c":3 , "d":4 , "e":5}
indexes_1 = ["a", "b", "c", "d", "e", "f", "g", "h"]

# Series 는 index 값을 기준으로 series 생성한다
serise_object_1 = Series(dict_data_1, index=indexes_1)
serise_object_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [57]:
# dataframe

In [58]:
# Series 를 모아서 만든 Data Table = 기본 2차원

In [59]:
# DataFrame

In [61]:
# example
raw_data = {
    'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'last_name': ['Miller', 'Jaconbson', 'Ali', 'Milner', 'Cooze'],
    'age': [42, 52, 36, 24, 73],
    'city' : ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']
}

df = pd.DataFrame(raw_data, columns= ['first_name', 'last_name', 'age', 'city'])
df

  first_name  last_name  age           city
0      Jason     Miller   42  San Francisco
1      Molly  Jaconbson   52      Baltimore
2       Tina        Ali   36          Miami
3       Jake     Milner   24        Douglas
4        Amy      Cooze   73         Boston

In [62]:
raw_data

{'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
 'last_name': ['Miller', 'Jaconbson', 'Ali', 'Milner', 'Cooze'],
 'age': [42, 52, 36, 24, 73],
 'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [63]:
DataFrame(raw_data, columns=["age", "city"]) # column 선택

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [78]:
# 새로운 column 추가
df = DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])
df

  first_name  last_name  age           city debt
0      Jason     Miller   42  San Francisco  NaN
1      Molly  Jaconbson   52      Baltimore  NaN
2       Tina        Ali   36          Miami  NaN
3       Jake     Milner   24        Douglas  NaN
4        Amy      Cooze   73         Boston  NaN

In [79]:
# Series 추출
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [80]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [81]:
type(df["first_name"])

pandas.core.series.Series

In [82]:
# dataframe indexing

In [83]:
# loc : index location
df.loc[1]

first_name        Molly
last_name     Jaconbson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [84]:
#iloc : index position
df["age"].iloc[1: ]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [85]:
df.loc[ :3, ["last_name"]]

   last_name
0     Miller
1  Jaconbson
2        Ali
3     Milner

In [86]:
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool

In [87]:
df

  first_name  last_name  age           city debt
0      Jason     Miller   42  San Francisco  NaN
1      Molly  Jaconbson   52      Baltimore  NaN
2       Tina        Ali   36          Miami  NaN
3       Jake     Milner   24        Douglas  NaN
4        Amy      Cooze   73         Boston  NaN

In [88]:
# column 에 새로운 데이터 할당
df.debt = df.age > 40
df

  first_name  last_name  age           city   debt
0      Jason     Miller   42  San Francisco   True
1      Molly  Jaconbson   52      Baltimore   True
2       Tina        Ali   36          Miami  False
3       Jake     Milner   24        Douglas  False
4        Amy      Cooze   73         Boston   True

In [89]:
values = Series(data=["M", "F", "F"], index=[0, 1, 3])
values

0    M
1    F
3    F
dtype: object

In [90]:
df

  first_name  last_name  age           city   debt
0      Jason     Miller   42  San Francisco   True
1      Molly  Jaconbson   52      Baltimore   True
2       Tina        Ali   36          Miami  False
3       Jake     Milner   24        Douglas  False
4        Amy      Cooze   73         Boston   True

In [91]:
df["sex"] = values
df

  first_name  last_name  age           city   debt  sex
0      Jason     Miller   42  San Francisco   True    M
1      Molly  Jaconbson   52      Baltimore   True    F
2       Tina        Ali   36          Miami  False  NaN
3       Jake     Milner   24        Douglas  False    F
4        Amy      Cooze   73         Boston   True  NaN

In [92]:
# transpose
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller  Jaconbson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
sex                     M          F    NaN        F     NaN

In [94]:
# to_csv() : csv 형태로 변환
df.to_csv()

',first_name,last_name,age,city,debt,sex\r\n0,Jason,Miller,42,San Francisco,True,M\r\n1,Molly,Jaconbson,52,Baltimore,True,F\r\n2,Tina,Ali,36,Miami,False,\r\n3,Jake,Milner,24,Douglas,False,F\r\n4,Amy,Cooze,73,Boston,True,\r\n'

In [95]:
# column 을 삭제 : 메모리 주소를 삭제
del df["debt"]
df

  first_name  last_name  age           city  sex
0      Jason     Miller   42  San Francisco    M
1      Molly  Jaconbson   52      Baltimore    F
2       Tina        Ali   36          Miami  NaN
3       Jake     Milner   24        Douglas    F
4        Amy      Cooze   73         Boston  NaN

In [ ]:
# drop